<details ><summary>apply for ruby-getting-started-terraform 2025-12-31 07:49:28 (UTC)</summary>
    <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role.scheduler will be created
  + resource "aws_iam_role" "scheduler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ruby-getting-started-scheduler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-scheduler-role"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-scheduler-role"
          + "Project"     = "ruby-getting-started"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.scheduler will be created
  + resource "aws_iam_role_policy" "scheduler" {
      + id          = (known after apply)
      + name        = "ruby-getting-started-scheduler-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:StopInstances",
                          + "rds:StopDBInstance",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_scheduler_schedule.stop_bastion will be created
  + resource "aws_scheduler_schedule" "stop_bastion" {
      + arn                          = (known after apply)
      + description                  = "Stop Bastion EC2 instance at 23:00 JST daily"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "ruby-getting-started-stop-bastion"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 14 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ec2:stopInstances"
          + input    = jsonencode(
                {
                  + InstanceIds = [
                      + "i-096998226f432cbc4",
                    ]
                }
            )
          + role_arn = (known after apply)
        }
    }

  # aws_scheduler_schedule.stop_rds will be created
  + resource "aws_scheduler_schedule" "stop_rds" {
      + arn                          = (known after apply)
      + description                  = "Stop RDS instance at 23:00 JST daily"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "ruby-getting-started-stop-rds"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 14 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:rds:stopDBInstance"
          + input    = jsonencode(
                {
                  + DBInstanceIdentifier = "ruby-getting-started-mysql"
                }
            )
          + role_arn = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_iam_role.scheduler: Creating...
aws_iam_role.scheduler: Creation complete after 1s [id=ruby-getting-started-scheduler-role]
aws_iam_role_policy.scheduler: Creating...
aws_scheduler_schedule.stop_bastion: Creating...
aws_scheduler_schedule.stop_rds: Creating...
aws_iam_role_policy.scheduler: Creation complete after 0s [id=ruby-getting-started-scheduler-role:ruby-getting-started-scheduler-policy]
aws_scheduler_schedule.stop_bastion: Creation complete after 10s [id=default/ruby-getting-started-stop-bastion]

```
</details>

<details ><summary>Error during applying.</summary>
  exit status 1
</details>

</details>